Revit 2027 API
CombinableElementArray.Append Method
Add the element to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	CombinableElement item
)
Public Overridable Sub Append (
	item As CombinableElement
)
public:
virtual void Append(
	CombinableElement^ item
)
abstract Append :
        item : CombinableElement -> unit
override Append :
        item : CombinableElement -> unit
Parameters
item CombinableElement
The CombinableElement to be added.
See Also
Reference
CombinableElementArray Class
Autodesk.Revit.DB Namespace